{
  "description": "У сучасній практиці захисту блокчейн-акаунтів сформувалися дві головні стратегії безпеки. Перша стратегія полягає у прямому захисті приватного ключа користувача – тобто у вжитті заходів, що унеможливлюють несанкціонований доступ до самого ключа або його втрату. Друга стратегія передбачає застосування додаткового рівня безпеки поверх базового рівня акаунта, зокрема через спеціалізовані механізми криптовалютних гаманців або смарт-контрактів. Втрата або компрометація приватного ключа неминуче призводить до втрати доступу до активів, тому питання надійного зберігання ключів є одним із центральних у галузі безпеки криптовалютних систем. Користувач повинен забезпечити не тільки захист ключа від несанкціонованого доступу, але й гарантувати можливість його відновлення в разі випадкової втрати чи пошкодження носія.",
  "keyHolder": {
    "name": "Носій ключа",
    "description": "Один з аспектів збереження приватного ключа від втрати чи несанкціонованого доступу — це ефективний та безпечний носій ключа.",
    "hardware": {
      "name": "Апаратний носій",
      "description": "Фізичний пристрій, що спеціально призначений для зберігання приватних ключів, який ізолює їх у захищеному апаратному середовищі (наприклад, у Secure Element) і не дозволяє експортувати назовні. Усі криптографічні операції (підпис транзакцій тощо) виконуються всередині пристрою без розкриття ключа зовнішнім додаткам, що унеможливлює його викрадення навіть у разі наявності шкідливого ПЗ на основному комп’ютері."
    },
    "software": {
      "name": "Програмний носій",
      "description": "Програмне середовище або додаток (наприклад, мобільний чи десктопний гаманець), що зберігає приватний ключ у пам’яті пристрою загального призначення. Це забезпечує користувачу легкий доступ до ключа та зручність використання, але водночас означає, що ключ знаходиться на пристрої, підключеному до інтернету, і тому потенційно вразливий до віддалених атак. Таким чином, програмний носій не має апаратної ізоляції; рівень його безпеки значною мірою залежить від захищеності операційної системи пристрою та обережності користувача."
    },
    "paper": {
      "name": "Паперовий носій",
      "description": "Фізичний папір або носій, на якому надруковано чи записано приватний ключ або seed-фразу. Він повністю ізольований від мережі і фактично виступає в ролі матеріального резервного носія ключа, а ризики пов’язані з фізичною безпекою (втрата, пошкодження) та відсутністю резервної копії."
    },
    "memory": {
      "name": "Пам’ять (мнемонічний носій)",
      "description": "Приватний ключ, що зберігається в пам’яті людини у вигляді мнемонічної чи парольної фрази. Такий підхід усуває будь-який фізичний носій, але практично несе високі ризики: забування фрази або використання надто простої фрази, яку можуть підібрати атакуючі сторони. Через ці причини, цей спосіб нині майже не застосовується у відповідальних сценаріях, поступаючись іншим носіям ключів."
    }
  }
}
