export const keyManagementContent = {
  description: `У сучасній практиці захисту блокчейн-акаунтів сформувалися дві головні стратегії безпеки. Перша стратегія полягає у прямому захисті приватного ключа користувача – тобто у вжитті заходів, що унеможливлюють несанкціонований доступ до самого ключа або його втрату. Друга стратегія передбачає застосування додаткового рівня безпеки поверх базового рівня акаунта, зокрема через спеціалізовані механізми криптовалютних гаманців або смарт-контрактів.

  Втрата або компрометація приватного ключа неминуче призводить до втрати доступу до активів, тому питання надійного зберігання ключів є одним із центральних у галузі безпеки криптовалютних систем. Користувач повинен забезпечити не тільки захист ключа від несанкціонованого доступу, але й гарантувати можливість його відновлення в разі випадкової втрати чи пошкодження носія.`,
  keyHolder: {
    name: "Носій ключа",
    description: "Один з аспектів збереження приватного ключа від втрати чи несанкціонованого доступу — це ефективний та безпечний носій ключа."
  },
  hardware: {
    name: "Апаратний носій",
    description: "Фізичний пристрій, що спеціально призначений для зберігання приватних ключів, який ізолює їх у захищеному апаратному середовищі (наприклад, у Secure Element) і не дозволяє експортувати назовні.",
    advantages: `**Переваги:**

* Високий рівень безпеки завдяки апаратній ізоляції.
* Ключ ніколи не залишає пристрій, що унеможливлює його викрадення.`,
    disadvantages: `**Недоліки:**

* Незручне використання: для підписання транзакцій потрібно підключати пристрій і фізично натискати на кнопки.
* Необхідність використання спеціальних програмних засобів для роботи з пристроєм.
* Висока вартість апаратних засобів.
* Можливість втрати або фізичного пошкодження пристрою.`,
  },
  software: {
    name: "Програмний носій",
    description: "Програмне середовище або додаток (наприклад, мобільний чи десктопний гаманець), що зберігає приватний ключ у пам'яті пристрою загального призначення.",
    advantages: `**Переваги:**

* Простота використання: користувач може легко підписати транзакцію, не виходячи з гаманця.`,
    disadvantages: `**Недоліки:**

* Небезпека втрати або компрометації ключа, оскільки ключ знаходиться у загальній пам'яті пристрою, що доступна для вірусів.`,
  },
  paper: {
    name: "Паперовий носій",
    description: "Фізичний папір або носій, на якому надруковано чи записано приватний ключ або seed-фразу. Він повністю ізольований від мережі і фактично виступає в ролі матеріального резервного носія ключа, а ризики пов'язані з фізичною безпекою (втрата, пошкодження) та відсутністю резервної копії.",
    advantages: `**Переваги:**

* Високий рівень безпеки, оскільки ключ завжди знаходиться на папері.`,
    disadvantages: `**Недоліки:**

* Вищий ризик пошкодження або втрати.
* Незручність використання: для підписання транзакцій користувачеві потрібно фізично відсканувати QR-код або ввести ключ вручну.`,
  },
  memory: {
    name: "Пам'ять (мнемонічний носій)",
    description: "Приватний ключ, що зберігається в пам'яті людини у вигляді мнемонічної чи парольної фрази. Через недоліки, цей спосіб нині майже не застосовується у відповідальних сценаріях, поступаючись іншим носіям ключів.",
    advantages: `**Переваги:**

* Високий рівень безпеки, оскільки ключ завжди знаходиться в пам'яті людини.`,
    disadvantages: `**Недоліки:**

* Дуже висока ненадійність через можливість забуття
* Незручність використання: для підписання транзакцій користувачеві потрібно ввести мнемонічну фразу вручну`,
  }
};
